{"type":"data","nodes":[null,{"type":"data","data":[{"articles":1},[2,10,17],{"file":3,"frontmatter":4,"content":9},"f250_ami.md",{"title":5,"author":6,"date":7,"image":8},"American truck F250","Enzuo","2024-08-24","f250_ami.png","\u003Cp>American cars tends to be on the larger side. This Ford \u003Cstrong>F250 Super Duty truck\u003C/strong> has a bed just large enough to carry the smallest car on our list : The citroen ami.\u003C/p>\n\u003Cp>\u003Ca href=\"compare?id=ford_f250&tid=0&cid=0&id=citroen_ami&tid=0&cid=0\">Go to comparison\u003C/a>\u003C/p>\n",{"file":11,"frontmatter":12,"content":16},"504.md",{"title":13,"author":6,"date":14,"image":15},"French classic, the 504","2024-08-17","504_savana.png","\u003Cp>The Peugeot 504 was introduced in 1968. It broke from Peugeot’s traditionally conservative design language, embracing a more modern and dynamic aesthetic.\u003C/p>\n\u003Ch3>A Long-Lasting Legacy in Africa\u003C/h3>\n\u003Cp>In countries like Nigeria, Côte d&#39;Ivoire, and Kenya, the 504 remained sold until the XXI century. The car&#39;s durability was largely due to its robust build quality, exceptional ground clearance, and rear-wheel-drive layout, making it well-suited for the challenging road conditions commonly found across the continent.\u003C/p>\n\u003Cp>The 504 eventually faced stiff competition from Japanese automakers. Brands like Toyota and Nissan began to gain a foothold in the African market in the late 1980s and 1990s, offering vehicles that were not only reliable but also more affordable and easier to maintain.\u003C/p>\n\u003Ch3>The American Market: A Brief but Notable Success\u003C/h3>\n\u003Cp>Interestingly, the 504 also found some success in the United States, one of the few French cars to do so in the post-war era. In the U.S., it was marketed as a premium European import. Its success in the U.S. was among the last of its kind for a French car, as the American market became increasingly dominated by German and Japanese imports.\u003C/p>\n\u003Cp>\u003Ca href=\"cars?id=peugeot_504\">Go to car page\u003C/a>\u003C/p>\n",{"file":18,"frontmatter":19,"content":23},"cybertruckc15d.md",{"title":20,"author":6,"date":21,"image":22},"Cybertruck vs C15D","2024-07-21","cybertruckc15d.png","\u003Cp>Reunited for an improbable duel, the Tesla Cybertruck vs the Citroën C15D.\nBoth vehicles boast cargo space large enough to transport a small hay bale or your various farming tools and can get you from point A to point B using the same time in your law abiding journey.\u003C/p>\n\u003Cp>Released to the public in 2023, the Cybertruck promised extraordinary capabilities. However, its initial tests left much to be desired, especially in terms of off-road performance, where it struggled with even basic obstacles. This shortfall led to humorous comparisons on the web with the Citroën C15D, a vehicle nearly 40 years older and ten times cheaper. Originally meant as a joke, these comparisons highlighted how a decades-old, budget-friendly vehicle could, in many ways, rival the futuristic Cybertruck in practical off-road capability.\u003C/p>\n\u003Cp>The C15D, despite its age, remains a model of durability and practicality while being exceptionally affordable. It’s no wonder you can still spot these workhorses navigating the rural roads of France.\u003C/p>\n\u003Cp>This comparison begs the question: Do you really need to spend a fortune to have fun and get the job done?\u003C/p>\n\u003Cp>Despite its flaws, the Cybertruck deserves credit for pushing the boundaries of automotive design and attempting to reinvigorate a field that has remained largely static for years. Innovation comes with risks and challenges, especially when trying to match or surpass the tried-and-true behemoths that have dominated the market for so long.\u003C/p>\n\u003Cp>\u003Ca href=\"compare?id=tesla_cybertruck&tid=0&cid=1&id=citroen_c15d&tid=0&cid=0\">Go to comparison\u003C/a>\u003C/p>\n"],"uses":{}}]}
